packages/fxa-auth-server/test/local/payments/fixtures/stripe/invoice_preview_tax.json

{
  "object": "invoice",
  "account_country": "US",
  "account_name": "Mozilla Corporation",
  "account_tax_ids": null,
  "amount_due": 2323,
  "amount_paid": 0,
  "amount_remaining": 2323,
  "application_fee_amount": null,
  "attempt_count": 0,
  "attempted": false,
  "automatic_tax": {
    "enabled": false,
    "status": null
  },
  "billing_reason": "upcoming",
  "charge": null,
  "collection_method": "charge_automatically",
  "created": 1638387404,
  "currency": "usd",
  "custom_fields": null,
  "customer": null,
  "customer_address": {
    "city": null,
    "country": "DE",
    "line1": null,
    "line2": null,
    "postal_code": null,
    "state": null
  },
  "customer_email": null,
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [
    {
      "id": "txr_1JALB2BVqmGyQTMa3ltU6p6y",
      "object": "tax_rate",
      "active": true,
      "country": "DE",
      "created": 1625604452,
      "description": "DE VAT",
      "display_name": "VAT",
      "inclusive": true,
      "jurisdiction": null,
      "livemode": false,
      "metadata": {},
      "percentage": 19,
      "state": null,
      "tax_type": null
    }
  ],
  "description": null,
  "discount": null,
  "discounts": [],
  "due_date": null,
  "ending_balance": 0,
  "footer": null,
  "last_finalization_error": null,
  "lines": {
    "object": "list",
    "data": [
      {
        "id": "il_tmp_1b032fBVqmGyQTMa6c981a47",
        "object": "line_item",
        "amount": 2323,
        "currency": "usd",
        "description": "1 × Robin K Wilson (at $23.23 / month)",
        "discount_amounts": [],
        "discountable": true,
        "discounts": [],
        "livemode": false,
        "metadata": {},
        "period": {
          "end": 1641065804,
          "start": 1638387404
        },
        "plan": {
          "id": "price_1JkZUtBVqmGyQTMabzHiPgmR",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 2323,
          "amount_decimal": "2323",
          "billing_scheme": "per_unit",
          "created": 1634239307,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "product": "prod_KPOHRv5MheicuD",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_1JkZUtBVqmGyQTMabzHiPgmR",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1634239307,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_KPOHRv5MheicuD",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 2323,
          "unit_amount_decimal": "2323"
        },
        "proration": false,
        "quantity": 1,
        "subscription": "sub_1K1ybgBVqmGyQTMapiusG1Xd",
        "subscription_item": "si_KhNMIdH4bqqOyQ",
        "tax_amounts": [
          {
            "amount": 371,
            "inclusive": true,
            "tax_rate": "txr_1JALB2BVqmGyQTMa3ltU6p6y"
          }
        ],
        "tax_rates": [],
        "type": "subscription"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/invoices/upcoming/lines?"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": 1638391004,
  "number": "72ABE14-0001",
  "on_behalf_of": null,
  "paid": false,
  "payment_intent": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null
  },
  "period_end": 1638387404,
  "period_start": 1638387404,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "quote": null,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "draft",
  "status_transitions": {
    "finalized_at": null,
    "marked_uncollectible_at": null,
    "paid_at": null,
    "voided_at": null
  },
  "subscription": "sub_1K1ybgBVqmGyQTMapiusG1Xd",
  "subscription_proration_date": 1638387404,
  "subtotal": 2323,
  "tax": 371,
  "total": 2323,
  "total_discount_amounts": [],
  "total_tax_amounts": [
    {
      "amount": 371,
      "inclusive": true,
      "tax_rate": "txr_1JALB2BVqmGyQTMa3ltU6p6y"
    }
  ],
  "transfer_data": null,
  "webhooks_delivered_at": null
}
